[
    {   
        "title": "Minecraft",
        "price": "26.95",
        "rating": "5",
        "developer": "Mojang Studios",
        "editor": "Mojang Studios, Xbox Game Studios",
        "releasedate": "18 de noviembre de 2011",
        "gamemod": ["Un jugador", "Multijugador"],
        "pegi": "7",
        "genre": ["Aventura", "Sandbox", "Supervivencia"],
        "platform": ["PC", "Play Station", "XBox", "Nintendo", "Móvil"],
        "imageFilename": "Minecraft-poster.webp",
        "shortdescription": "Crea todo lo que puedas imaginar, descubre misterios espeluznantes y sobrevive a la noche en el juego de aventura tipo sandbox definitivo. En Minecraft, cada partida es diferente y te esperan aventuras inolvidables a la vuelta de la esquina. Explora y crea tu camino a un mundo infinito al que le puedes dar forma bloque a bloque.",
        "longdescription": "Minecraft es un juego de mundo abierto, y no tiene un fin claramente definido (aunque sí que tiene una dimensión llamada a sí misma 'The End', o en español 'El Final' en donde después de entrar y matar a la dragona aparecen los créditos del juego y un poema).Esto permite una gran libertad en cuanto a la elección de su forma de jugar. A pesar de ello, el juego posee un sistema que otorga logros por completar ciertas acciones. La cámara es en primera persona, aunque los jugadores tienen la posibilidad de cambiarla a una perspectiva de tercera persona en cualquier momento.El jugador tiene la libertad de definir la dificultad del juego, siendo el modo más tranquilo el pacífico, que a diferencia de las demás dificultades, no permite que aparezcan monstruos en el juego que puedan herir al jugador.",
        "reviews": 
        [
            {
                "username": "PVilla",
                "comment": "Minecraft es un juego increíblemente versátil que permite a los jugadores expresar su creatividad de maneras infinitas. La libertad para construir, explorar y crear en un mundo generado por bloques es simplemente fascinante. Además, la comunidad activa y la posibilidad de jugar con amigos hacen que la experiencia sea aún más divertida. Sin duda, Minecraft es un juego que ha dejado una huella imborrable en la industria de los videojuegos.",
                "date": "18/01/18",
                "rating": "4.5",
                "imageFilename": "minecraft_2.jpg"
            },
            {
                "username": "Minicrack",
                "comment": "Minecraft es mucho más que un simple juego; es una plataforma para la imaginación y la colaboración. La capacidad de construir estructuras impresionantes, explorar vastos mundos y participar en aventuras emocionantes lo convierte en una experiencia única. Además, la comunidad creativa que rodea al juego ofrece una gran cantidad de contenido adicional, desde mods hasta mapas personalizados. Minecraft es un juego que nunca deja de sorprender y entretener.",
                "date": "10/06/24",
                "rating": "3.5",
                "imageFilename": "minecraft_3.jpg"
            }
        ]
    },
    {   
        "title": "The Legend of Zelda",
        "price": "8.99",
        "rating": "4.5",
        "imageFilename": "Zelda-poster.png"        
    },
    {   
        "title": "Super Mario Bros",
        "price": "24.95",
        "rating": "4",
        "imageFilename": "SuperMario-poster.jpg"
    },
    {   
        "title": "Animal Crossing",
        "price": "14.95",
        "rating": "4.5",
        "imageFilename": "Animal Crossing-poster.webp"
    },
    {   
        "title": "Fortnite",
        "price": "GRATIS",
        "rating": "4.5",
        "imageFilename": "Fortnite-poster.jpg"
    },
    {   
        "title": "Hollow Knight",
        "price": "12.95",
        "rating": "5",
        "imageFilename": "Hollow-poster.png"
    },
    {   
        "title": "GTA V",
        "price": "19.99",
        "rating": "5",
        "imageFilename": "GTA-poster.png"
    },
    {   
        "title": "Sims",
        "price": "4.99",
        "rating": "3.5",
        "imageFilename": "TheSims-poster.webp"
    },
    {   
        "title": "FIFA",
        "price": "69.99",
        "rating": "4",
        "imageFilename": "Fifa-poster.jpg"
    }
]
