[
    {   
        "title": "Minecraft",
        "price": "26.95",
        "rating": "5",
        "developer": "Mojang Studios",
        "editor": "Mojang Studios, Xbox Game Studios",
        "release_date": "2011-11-18",
        "gamemod": ["Un jugador", "Multijugador"],
        "age_classification": "7",
        "genre": ["Supervivencia", "Aventura", "Sandbox", "Mundo Abierto"],
        "platform": ["Play Station", "XBox", "Nintendo", "PC", "Móvil"],
        "imageFilename": "Minecraft-poster.webp",
        "short_description": "Crea todo lo que puedas imaginar, descubre misterios espeluznantes y sobrevive a la noche en el juego de aventura tipo sandbox definitivo. En Minecraft, cada partida es diferente y te esperan aventuras inolvidables a la vuelta de la esquina. Explora y crea tu camino a un mundo infinito al que le puedes dar forma bloque a bloque.",
        "description": "Minecraft es un juego de mundo abierto, y no tiene un fin claramente definido (aunque sí que tiene una dimensión llamada a sí misma 'The End', o en español 'El Final' en donde después de entrar y matar a la dragona aparecen los créditos del juego y un poema). Esto permite una gran libertad en cuanto a la elección de su forma de jugar. A pesar de ello, el juego posee un sistema que otorga logros por completar ciertas acciones. La cámara es en primera persona, aunque los jugadores tienen la posibilidad de cambiarla a una perspectiva de tercera persona en cualquier momento.El jugador tiene la libertad de definir la dificultad del juego, siendo el modo más tranquilo el pacífico, que a diferencia de las demás dificultades, no permite que aparezcan monstruos en el juego que puedan herir al jugador.",
        "reviews":
        [
            {
                
                "username": "PVilla",
                "comment": "Minecraft es un juego increíblemente versátil que permite a los jugadores expresar su creatividad de maneras infinitas. La libertad para construir, explorar y crear en un mundo generado por bloques es simplemente fascinante. Además, la comunidad activa y la posibilidad de jugar con amigos hacen que la experiencia sea aún más divertida. Sin duda, Minecraft es un juego que ha dejado una huella imborrable en la industria de los videojuegos.",
                "date": "18/01/18",
                "rating": "4.5",
                "imageFilename": "minecraft_2.jpg"
            },
            
            {
                "username": "Minicrack",
                "comment": "Minecraft es mucho más que un simple juego; es una plataforma para la imaginación y la colaboración. La capacidad de construir estructuras impresionantes, explorar vastos mundos y participar en aventuras emocionantes lo convierte en una experiencia única. Además, la comunidad creativa que rodea al juego ofrece una gran cantidad de contenido adicional, desde mods hasta mapas personalizados. Minecraft es un juego que nunca deja de sorprender y entretener.",
                "date": "10/06/24",
                "rating": "3.5",
                "imageFilename": "minecraft_3.jpg"
            }
        ]
    },

    {   
        "title": "The Legend of Zelda",
        "price": "8.99",
        "rating": "4.5",
        "imageFilename": "Zelda-poster.png",
        "developer": "Nintendo Entertainment Planning & Development",
        "editor": "Nintendo Entertainment Planning & Development",
        "release_date": "2017-03-03",
        "gamemod": ["Un jugador", "Historia"],
        "age_classification": "12",
        "genre": ["Aventura", "Mundo Abierto"],
        "platform": ["Nintendo"],
        "short_description": "\"The Legend of Zelda: Breath of the Wild\" es una épica aventura de mundo abierto. Tomas el control de Link, quien despierta en un Hyrule devastado tras 100 años. El juego ofrece una libertad sin precedentes para explorar un mapa gigantesco, escalar cualquier montaña y planear por valles. Experimenta con un motor de físicas avanzado, resuelve puzles en Santuarios y sobrevive cocinando y gestionando un arsenal de armas. El objetivo final: derrotar a Calamity Ganon.",
        "description": "\"The Legend of Zelda: Breath of the Wild\" es un título de acción-aventura que redefinió el género de mundo abierto y la propia franquicia de Zelda. El juego sitúa al jugador en la piel de Link, quien despierta de un letargo de 100 años en un reino de Hyrule vasto y post-apocalíptico, devastado por una entidad maligna conocida como Calamity Ganon. Su principal característica es la libertad absoluta. Desde el primer momento, el jugador puede dirigirse a cualquier punto del inmenso mapa que vea en el horizonte. Esta exploración se ve impulsada por un innovador motor de física y \"química\", donde elementos como el fuego, el viento, la electricidad y el hielo interactúan de formas lógicas y creativas. Link puede escalar casi cualquier superficie, planear con una paravela y domar caballos salvajes. En lugar de las mazmorras lineales tradicionales, la progresión se basa en la exploración de más de 100 Santuarios (Shrines) que ofrecen puzles y desafíos cortos, y la liberación de cuatro colosales Bestias Divinas (Divine Beasts). El juego también introduce mecánicas de supervivencia: es necesario cocinar alimentos para recuperar salud y obtener mejoras, y las armas se degradan y rompen con el uso, forzando al jugador a adaptarse constantemente. Con un estilo artístico cel-shading evocador y una narrativa minimalista que se descubre a través de recuerdos perdidos, BOTW es una obra maestra de la exploración y la aventura.",
        "reviews": []
    },

    {   
        "title": "Super Mario Bros",
        "price": "24.95",
        "rating": "4",
        "imageFilename": "SuperMario-poster.jpg",
        "developer": "Nintendo Entertainment Planning & Development",
        "editor": "Nintendo Entertainment Planning & Development",
        "release_date": "2019-01-11",
        "gamemod": ["Un jugador", "Multijugador", "Cooperativo"],
        "age_classification": "3",
        "genre": ["Aventura"],
        "platform": ["Nintendo"],
        "short_description": "\"New Super Mario Bros. U Deluxe\" (2019) es una versión mejorada para Nintendo Switch del plataformas 2D de Wii U. Incluye el juego original y su expansión \"New Super Luigi U\", sumando 164 niveles. El objetivo sigue siendo rescatar a Peach de Bowser. Esta edición añade a Toadette (que usa la Supercorona para ser Peachette) y a Caco Gazapo como personajes jugables, ambos diseñados para hacer la aventura más accesible a nuevos jugadores. Permite multijugador local de hasta 4 personas.",
        "description": "\"New Super Mario Bros. U Deluxe\" es la versión definitiva del aclamado juego de plataformas 2D que se lanzó originalmente en la Wii U. Lanzado para Nintendo Switch el 11 de enero de 2019, este título combina el juego base \"New Super Mario Bros. U\" y su expansión más difícil y rápida, \"New Super Luigi U\", ofreciendo un paquete masivo con más de 164 niveles. El juego recupera la fórmula clásica de Mario: correr, saltar y derrotar enemigos a través de mundos vibrantes para rescatar a la Princesa Peach de las garras de Bowser. Su jugabilidad es un retorno pulido al estilo que hizo famoso al original \"Super Mario Bros.\", pero con gráficos en alta definición, un mapa del mundo interconectado (similar a \"Super Mario World\") y un divertido modo multijugador cooperativo para hasta cuatro jugadores simultáneos. La principal novedad de la versión \"Deluxe\" es la inclusión de dos nuevos personajes jugables diseñados para ayudar a los jugadores menos experimentados: Caco Gazapo (Nabbit), que no recibe daño de los enemigos, y Toadette. Toadette tiene un power-up exclusivo, la Supercorona, que la transforma en \"Peachette\", permitiéndole realizar un doble salto y flotar lentamente, facilitando mucho la superación de obstáculos. Es la experiencia de plataformas 2D de Mario más completa y accesible disponible en la Switch.",
        "reviews": []
    },

    {   
        "title": "Animal Crossing",
        "price": "14.95",
        "rating": "4.5",
        "imageFilename": "Animal Crossing-poster.webp",
        "developer": "Nintendo Entertainment Planning & Development",
        "editor": "Nintendo Entertainment Planning & Development",
        "release_date": "2020-03-20",
        "gamemod": ["Un jugador", "Multijugador", "Cooperativo"],
        "age_classification": "3",
        "genre": ["Simulación", "Mundo Abierto", "Sandbox"],
        "platform": ["Nintendo"],
        "short_description": "\"Animal Crossing: New Horizons\" (2020) es el popular simulador de vida de Nintendo Switch. El jugador se traslada a una isla desierta para construir una comunidad desde cero. El juego se centra en la fabricación (crafteo) de herramientas y muebles usando recursos naturales. La partida se sincroniza con el reloj real, afectando las estaciones y eventos. Es una experiencia relajante de creatividad y recolección.",
        "description": "\"Animal Crossing: New Horizons\" (2020) es un encantador y relajante simulador de vida y comunidad exclusivo de Nintendo Switch. El juego comienza cuando el jugador acepta el \"Plan de Asentamiento en Islas Desiertas\" de Nook Inc., viajando a una isla virgen para empezar una nueva vida desde cero, inicialmente viviendo en una tienda de campaña. A diferencia de títulos anteriores donde el jugador se mudaba a un pueblo ya establecido, \"New Horizons\" pone un énfasis sin precedentes en la creación y personalización. La mecánica central es la fabricación (crafteo): el jugador debe recolectar recursos naturales como madera, piedra y hierbas para construir sus propias herramientas, muebles y objetos decorativos mediante \"Proyectos de Bricolaje\". El juego transcurre en tiempo real, sincronizado con el reloj y el calendario del mundo real. Esto afecta a todo: las estaciones cambian, la fauna (peces, insectos) varía, y se celebran eventos festivos. El jugador actúa como \"Representante vecinal\", trabajando para atraer nuevos vecinos (animales antropomórficos con distintas personalidades), construir infraestructuras (puentes, tiendas, un museo) y, finalmente, obtener la capacidad de terraformar, permitiéndole modificar el paisaje de la isla, crear ríos, cascadas y acantilados. \"New Horizons\" ofrece una escapada pacífica, sin presión ni objetivos estrictos, centrada en la expresión creativa, la recolección y la conexión social (visitando las islas de amigos en línea).",
        "reviews": []
    },

    {   
        "title": "Fortnite",
        "price": "GRATIS",
        "rating": "4.5",
        "imageFilename": "Fortnite-poster.jpg",
        "developer": "Epic Games",
        "editor": "Epic Games",
        "release_date": "2017-09-26",
        "gamemod": ["Un jugador", "Multijugador", "Competitivo", "Cooperativo"],
        "age_classification": "12",
        "genre": ["Aventura", "Battle Royale", "Shooters", "Supervivencia", "Mundo Abierto"],
        "platform": ["Play Station", "XBox", "Nintendo", "PC"],
        "short_description": "\"Fortnite\" es un exitoso videojuego free-to-play de Epic Games, centrado en su popular modo \"Battle Royale\". 100 jugadores luchan en una isla por ser el último superviviente mientras el mapa se encoge. Su característica única es la construcción, que permite a los jugadores crear estructuras defensivas en tiempo real. Es conocido por sus constantes actualizaciones y sus colaboraciones con la cultura pop, convirtiéndose en una plataforma de entretenimiento global.",
        "description": "\"Fortnite\", es un fenómeno cultural y un videojuego en constante evolución que trasciende el género de disparos. Aunque comenzó como un juego de supervivencia cooperativo (PVE) llamado \"Salvar el Mundo\", su popularidad global explotó con el lanzamiento de su modo gratuito \"Battle Royale\" en 2017. En este modo, 100 jugadores son lanzados desde un autobús volador a una isla masiva cuyo mapa cambia drásticamente con cada \"temporada\". El objetivo es ser el último jugador o equipo en pie mientras una tormenta mortal encoge el área de juego. La mecánica que define a \"Fortnite\" y lo diferencia de sus competidores es la construcción. Los jugadores pueden recolectar recursos (madera, piedra y metal) del entorno para construir muros, rampas, suelos y techos sobre la marcha. Esta habilidad añade una capa táctica inmensa, permitiendo crear defensas instantáneas, ganar ventaja de altura o tender trampas. Más allá del combate, \"Fortnite\" se ha convertido en una plataforma social y un \"metaverso\". Es famoso por sus eventos en vivo a gran escala, como conciertos virtuales (Travis Scott, Ariana Grande) y estrenos de películas. Su modelo free-to-play se sostiene mediante la venta de cosméticos, como skins (atuendos), picos y bailes (emotes), incluyendo innumerables colaboraciones con franquicias como Marvel, Star Wars, DC Comics y figuras del deporte.",
        "reviews": []
    },

    {   
        "title": "Hollow Knight",
        "price": "12.95",
        "rating": "5",
        "imageFilename": "Hollow-poster.png",
        "developer": "Team Cherry",
        "editor": "Team Cherry",
        "release_date": "2017-02-24",
        "gamemod": ["Un jugador", "Historia"],
        "age_classification": "7",
        "genre": ["Aventura", "Indie", "Supervivencia", "Estrategia"],
        "platform": ["Play Station", "XBox", "Nintendo", "PC"],
        "short_description": "\"Hollow Knight\" (2017) es un aclamado juego indie de acción y aventura (Metroidvania) desarrollado por Team Cherry. El jugador controla a un silencioso Caballero que explora el vasto y ruinoso reino subterráneo de Hallownest, habitado por insectos. Destaca por su combate desafiante y preciso, su profunda exploración no lineal y un apartado artístico 2D dibujado a mano de estilo gótico y melancólico. El objetivo es descubrir los secretos de la infección que asoló el reino.",
        "description": "\"Hollow Knight\" es una aclamada obra maestra de acción y aventura desarrollada por el estudio independiente Team Cherry. El juego sumerge al jugador en el vasto y melancólico reino subterráneo de Hallownest, una civilización de insectos caída en desgracia por una misteriosa \"infección\". El jugador controla al Caballero (The Knight), un pequeño y silencioso viajero armado con un aguijón (clavo), que se adentra en las profundidades para descubrir la verdad de este lugar. Su jugabilidad se centra en tres pilares: exploración no lineal, Hallownest es un mapa gigantesco e interconectado, lleno de atajos, secretos y biomas distintos (desde ciudades en ruinas y cuevas de cristal hasta jardines frondosos); combate preciso, el combate es desafiante, rápido y técnico que requiere aprender patrones de ataque de una enorme variedad de enemigos y jefes memorables; y progresión de habilidades, a medida que avanza, el Caballero adquiere nuevas habilidades (como el dash, el doble salto o la escalada) que le permiten acceder a zonas previamente bloqueadas. El juego es célebre por su estilo artístico 2D dibujado a mano, que es a la vez gótico y encantador; su atmósfera inquietante y absorbente; y una banda sonora orquestal melancólica. La narrativa es sutil y críptica, contada principalmente a través del entorno, descripciones de objetos (Amuletos) y los peculiares habitantes que aún quedan en Hallownest.",
        "reviews": []
    },

    {   
        "title": "GTA V",
        "price": "19.99",
        "rating": "5",
        "imageFilename": "GTA-poster.png",
        "developer": "Rockstar Games",
        "editor": "Rockstar Games",
        "release_date": "2013-09-17",
        "gamemod": ["Un jugador", "Multijugador", "Historia", "Competitivo", "Cooperativo"],
        "age_classification": "18",
        "genre": ["Aventura", "Mundo Abierto", "Shooters"],
        "platform": ["Play Station", "XBox", "PC"],
        "short_description": "\"Grand Theft Auto V\" es un superventas de acción en mundo abierto de Rockstar Games, ambientado en la satírica ciudad de Los Santos (Los Ángeles). Su modo historia sigue a tres protagonistas (Michael, Franklin y Trevor) cuyas vidas se cruzan para realizar grandes atracos. Ofrece una libertad de exploración inmensa y es mundialmente famoso por su componente multijugador, \"GTA Online\", un mundo criminal persistente donde los jugadores compiten y cooperan.",
        "description": "\"Grand Theft Auto V\", es un hito cultural y uno de los videojuegos más vendidos de todos los tiempos. Es un título de acción y aventura en un mundo abierto masivo ambientado en la ficticia ciudad de Los Santos, una vibrante y satírica representación de Los Ángeles, y el extenso territorio de Blaine County. La innovación principal de su aclamada campaña para un jugador es la introducción de tres protagonistas jugables entre los que se puede alternar: Michael De Santa, un ladrón de bancos retirado que vive una crisis de mediana edad; Franklin Clinton, un joven estafador callejero que busca ascender en el mundo criminal; y Trevor Philips, un psicópata violento e impredecible. Sus historias se entrelazan magistralmente mientras planean y ejecutan una serie de atrevidos y complejos atracos. El juego ofrece una libertad casi absoluta, permitiendo al jugador explorar, conducir, volar y participar en un sinfín de actividades, desde misiones de disparos hasta jugar al golf o al tenis. Todo ello envuelto en una aguda sátira de la cultura moderna estadounidense. Su longevidad se debe, en gran parte, a \"GTA Online\", un universo multijugador persistente y en constante expansión. En este modo, los jugadores crean su propio personaje para construir un imperio criminal, comprando propiedades, vehículos y participando en misiones cooperativas, carreras y modos competitivos con millones de jugadores.",
        "reviews": []
    },

    {   
        "title": "Sims",
        "price": "4.99",
        "rating": "3.5",
        "imageFilename": "TheSims-poster.webp",
        "developer": "Maxis",
        "editor": "Electronic Arts",
        "release_date": "2014-09-02",
        "gamemod": ["Un jugador"],
        "age_classification": "12",
        "genre": ["Simulación", "Estrategia", "Mundo Abierto", "Sandbox"],
        "platform": ["Play Station", "XBox", "Nintendo", "PC"],
        "short_description": "\"Los Sims 4\" es el popular simulador de vida de EA donde tú creas y controlas la vida de personajes virtuales (Sims). El juego te permite diseñar Sims únicos con personalidades propias y construir las casas de sus sueños en el \"Modo Construir\". En el \"Modo Vivir\", gestionas sus carreras, relaciones, familias y emociones. Es un juego \"sandbox\" centrado en la creatividad y la narrativa personal, cuyo juego base es gratuito y se expande mediante numerosos packs de contenido de pago.",
        "description": "\"Los Sims 4\", es la cuarta entrega principal de la icónica saga de simulación de vida. Este videojuego se define por ser un \"sandbox\" (mundo abierto creativo) donde el jugador tiene el poder de crear y controlar la vida de personajes virtuales llamados \"Sims\". La experiencia se divide en tres pilares fundamentales: crear un Sim (CAS), un editor de personajes increíblemente detallado donde los jugadores moldean la apariencia física, eligen atuendos y, crucialmente, definen sus rasgos de personalidad, aspiraciones vitales y forma de andar; Modo Construir, una herramienta intuitiva y potente que permite diseñar, construir y decorar las casas de los Sims, desde simples apartamentos hasta mansiones elaboradas, con un sistema flexible basado en habitaciones; Modo Vivir, aquí es donde el jugador gestiona el día a día de los Sims. Se deben satisfacer sus necesidades básicas (hambre, vejiga, diversión, social...) mientras se les guía para alcanzar sus objetivos. \"Los Sims 4\" puso un fuerte énfasis en el sistema de emociones, haciendo que los Sims se sientan felices, tristes, enfadados o inspirados, lo que afecta directamente a sus acciones y decisiones. Los jugadores guían a sus Sims a través de carreras profesionales, les ayudan a desarrollar habilidades, a forjar amistades y romances, y a formar familias que perduran por generaciones.",
        "reviews": []
    },

    {   
        "title": "FIFA",
        "price": "69.99",
        "rating": "4",
        "imageFilename": "Fifa-poster.jpg",
        "developer": "Electronic Arts",
        "editor": "Electronic Arts",
        "release_date": "2024-09-27",
        "gamemod": ["Un jugador", "Multijugador", "Competitivo", "Cooperativo", "Práctica/Entrenamiento"],
        "age_classification": "3",
        "genre": ["Deportes", "Simulación", "Estrategia"],
        "platform": ["Play Station", "XBox", "PC"],
        "short_description": "\"EA Sports FC 25\" es el simulador de fútbol de EA Sports lanzado en 2024, sucesor de la saga \"FIFA\". El juego se centra en el realismo gracias a la tecnología HyperMotion avanzada y los \"Estilos de Juego+\" (PlayStyles+), que dan habilidades únicas a los futbolistas estrella. Su modo principal es Ultimate Team, que combina jugadores y jugadoras. También incluye los modos Carrera, Clubs y VOLTA, y mantiene las licencias clave como la Champions League y las grandes ligas europeas.",
        "description": "\"EA Sports FC 25\" es la segunda entrega de la renombrada franquicia de simulación de fútbol de Electronic Arts tras su cambio de marca. Este título consolida la nueva identidad de la saga, profundizando en el realismo y la autenticidad en el campo de juego virtual. El pilar tecnológico sigue siendo el motor Frostbite junto con una versión evolucionada de la tecnología HyperMotion, que utiliza datos volumétricos capturados de cientos de partidos reales para generar animaciones ultrarrealistas y movimientos fluidos y específicos para cada jugador. Una de las características más destacadas es la expansión del sistema PlayStyles+ (Estilos de Juego+), que otorga habilidades distintivas a los jugadores de élite, haciendo que sus contrapartes virtuales se comporten de manera idéntica a como lo hacen en la vida real. En cuanto a los modos de juego, Ultimate Team sigue siendo el modo estrella, continuando con la integración total de futbolistas masculinas y femeninas en el mismo ecosistema y expandiendo el sistema de \"Evoluciones\" para mejorar las cartas de los jugadores. El Modo Carrera (tanto de Mánager como de Jugador) recibe actualizaciones en la gestión táctica y el desarrollo de jóvenes promesas. Los modos sociales como Clubs (anteriormente Pro Clubs) y VOLTA Football también regresan, manteniendo el cross-play entre plataformas de la misma generación.",
        "reviews": []
    }
]
